package com.example.demo.viewmodels

import com.example.demo.model.CDate
import com.example.demo.services.CServiceDates
import javafx.beans.property.SimpleBooleanProperty
import tornadofx.*

/*******************************************************************************************************
 * Модель представления для списка дат.                                                                *
 * @author Макарова П.Ф. 26.03.2023                                                      *
 *******************************************************************************************************/
class CViewModelDatesList                 : Controller()
{
    //Сервис с логикой для работы со списком дат.
    private val serviceDates              : CServiceDates by inject()

    //Список даты с возможность отслеживания изменений.
    val dates                             = serviceDates.getAll()

    //Факт наличия выделения в таблице.
    //От него зависит активность некоторых кнопок.
    val elementSelected                       = SimpleBooleanProperty(false)

    /***********************************************************************************
     * Добавление пустой записи в таблицу.                                             *
     **********************************************************************************/
    fun add()
    {
        serviceDates.add(CDate()) //Передача данных на сервер
    }

    /**************************************************************************************
     * Удаление записи из списка.                                                         *
     * @param item - элемент для удаления.                                                *
     *************************************************************************************/
    fun delete(item:CDate?)
    {
        //Если элемент не указан - ничего не делаем.
        item ?: return
        serviceDates.delete(item) //Передача данных на сервер
    }

    /***********************************************************************************
     * Обработка изменения выделенных элементов в списке.                              *
     * @param selectedItem - выделенный элемент.                                       *
     **********************************************************************************/
    fun onSelectionChange(selectedItem:CDate?)
    {
        elementSelected.set(selectedItem != null)
    }

    /***************************************************************************************
     * Отправка всех текущих данных из списка на сервер.                                   *
     **************************************************************************************/
    fun saveAll()
    {
        serviceDates.saveAll() //Передача команды на отправку данных на сервер
    }
}
