package ru.psu.java.laba2.makmikcro.model

import java.util.*

/*******************************************************************************************************
 * Специальный интерфейс, позволяющий получить результаты запроса из СУБД, которые не укладываются     *
 * в сущность даты (здесь дополнительно есть поле - количество count).                                 *
 * @author Макарова П.Ф. 12.03.2023                                                                    *
 *******************************************************************************************************/

interface IDateWithCounter {
    val id: UUID
    val date: String
    val count: Int
}
