package com.example.demo.services

import com.example.demo.model.CDate
import com.example.demo.repositories.CRepositoryDate
import tornadofx.*
import java.util.*

/*******************************************************************************************
 * Сервис с логикой для работы со списком даты.                                            *
 * @author Макарова П.Ф. 26.03.2023                                                      *
 *******************************************************************************************/
class CServiceDates                      : Controller()
{
    private val repositoryDates          : CRepositoryDate by inject()
    /***************************************************************************************
     * Запрос списка всех доступных объектов на сервере.                                   *
     **************************************************************************************/
    fun getAll()=repositoryDates.getAll()


    /**************************************************************************************
     * Отправка данных объекта на сервер.                                                 *
     * @param date - объект для отправки.                                                 *
     **************************************************************************************/
    fun save(date: CDate)=repositoryDates.save(date)

    /*****************************************************************************************
     * Отправка всех данных из списка на сервер.                                             *
     *****************************************************************************************/
    fun saveAll()=repositoryDates.saveAll()

    /******************************************************************************************
     * Отправка данных объекта на сервер.                                                     *
     * @param date - объект для отправки.                                                     *
     ******************************************************************************************/
    fun add(date:CDate) {
        date.id                          = UUID.randomUUID()
        repositoryDates.add(date)
    }

    /*******************************************************************************************
     * Отправка данных объекта на сервер.                                                      *
     * @param date - объект для отправки.                                                      *
     *******************************************************************************************/
    fun delete(date:CDate)=repositoryDates.delete(date)
}

